TRUNCATE TABLE "Items" RESTART IDENTITY CASCADE;
TRUNCATE TABLE "WatchBoms" RESTART IDENTITY CASCADE;

INSERT INTO "Items"("Name") VALUES
	('Электронные часы'),
	('Корпус'),
	('Электронная плата'),
	('Дисплей'),
	('Батарейка'),
	('Основание'),
	('Задняя крышка'),
	('Защитное стекло'),
	('Винт'),
	('Стеклянная пластина'),
	('Защитная плёнка'),
	('Печатная плата'),
	('Разъём'),
	('Транзистор'),
	('Микроконтроллер'),
	('Кварцевый генератор'),
	('LCD-панель'),
	('Модуль подсветки');


INSERT INTO "WatchBoms"("ParentId", "ChildId", "Count") VALUES 
	(1, 2, 1),
	(1, 3, 1),
	(1, 4, 1),
	(1, 5, 1),
	(2, 6, 1),
	(2, 7, 1),
	(2, 8, 1),
	(2, 9, 4),
	(8, 10, 1),
	(8, 11, 1),
	(3, 12, 1),
	(3, 15, 1),
	(3, 16, 1),
	(12, 13, 2),
	(12, 14, 50),
	(4, 17, 1),
	(4, 18, 2);